#задачка1 

#написать функцию, которой на вход подается номер билетика, состоящий из 6 случайных цифр от 0 до 9
#на выход идет ответ, является ли билетик счастливым


#дополнение: можно генерить номер билетика случайным образом

#какова сложность алгоритма? какова вероятность получить счастливый билетик за n посещений автобуса?

#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  
#задачка 2
#на вход подается 6 чисел, которые образуют 3 закрытых интервалы (или открытых, если inf)
#числа не должны повторяться. также подается одно число. на выход: образованные интервалы и
#и ответ, принадлежит ли введеное число интервалу.
  

#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#задание 3
#написать функцию, которая выводит последовательность: 1,2,2,3,3,3,4,4,4,4 и т.д
#на вход идет только n - число элементов, которое должно быть выведено


#есть также функция rep()

#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#задание 4
#написать функцию, которая считывает:
#какой-то массив
#какое-то число x
#на выходе выводит все позиции, на которых встречается число x;



#но также есть функция which()
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~